# SketchCurveNotModelable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..SketchCurveNotModelable Property
BuiltInFailures..::..MassFailures Class See Also
---
This action cannot be completed. An element created by massing has a sketch line that cannot be modeled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchCurveNotModelable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchCurveNotModelable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchCurveNotModelable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace